
&НаКлиенте
Процедура Рассчитать(Команда) 
	
	//КоличествоДнейЗайма=((ДатаВозвратаЗайма-ДатаПолученияЗайма)/60/60/24); 
	 
	ТекущаяСуммаЗайма=СуммаЗайма;
	ТекущийДеньНедели=ДатаПолученияЗайма;
	Пока НачалоДня(ТекущийДеньНедели)<=НачалоДня(ДатаВозвратаЗайма) Цикл
	Если ДеньНедели(ТекущийДеньНедели)<6 Тогда
		КоличествоДнейВГоду=ДеньГода(КонецГода(ТекущийДеньНедели));	
		ПроцентыВДень=ТекущаяСуммаЗайма*ПроцентнаяСтавкаВГодовыхПроцентах/100/КоличествоДнейВГоду;
	ТекущаяСуммаЗайма=ТекущаяСуммаЗайма+ПроцентыВДень;  
	Если ДосрочноеПогашение Тогда 
		  Если  НачалоДня(ДатаДосрочногоПогашения)=НачалоДня(ТекущийДеньНедели)
			Тогда ТекущаяСуммаЗайма=ТекущаяСуммаЗайма-СуммаДосрочногоПогашения;
			КонецЕсли
		КонецЕсли;
	КонецЕсли;
 ТекущийДеньНедели= ДеньТекущий(ТекущийДеньНедели);
КонецЦикла;
Если СуммаДосрочногоПогашения>СуммаЗайма/2 Тогда
Сообщить("Сумма досрочного погашения больше половины суммы займа");
КонецЕсли; 
Если  ДосрочноеПогашение Тогда 
ИтогоКВозврату=ТекущаяСуммаЗайма;
ПереплатаСоставит= ТекущаяСуммаЗайма-(СуммаЗайма-СуммаДосрочногоПогашения);
Иначе
ИтогоКВозврату=ТекущаяСуммаЗайма;
ПереплатаСоставит=ТекущаяСуммаЗайма-СуммаЗайма;
КонецЕсли;
КонецПроцедуры
	
 	Функция ДеньТекущий(Дата)
		 Возврат Дата+60*60*24;
		 //git
	КонецФункции

&НаКлиенте
Процедура ДатаПолученияЗаймаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДатаВозвратаЗаймаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СуммаЗаймаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПроцентнаяСтавкаВГодовыхПроцентахПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ИтогоКВозвратуПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПереплатаСоставитПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПриИзменении(Элемент)
	Элементы.Группа3.Видимость=ДосрочноеПогашение;
КонецПроцедуры

